# iFilmsBotz

class Script(object):
    START_TXT = """<b>Hᴇʟʟᴏ {},</b>

<b>Mʏ Nᴀᴍᴇ Is <a href=https://t.me/{}>{}</a>, I Cᴀɴ Pʀᴏᴠɪᴅᴇ Mᴏᴠɪᴇs Aɴᴅ Sᴇʀɪᴇs, Jᴜsᴛ Aᴅᴅ Mᴇ Tᴏ Yᴏᴜʀ Gʀᴏᴜᴘ Aɴᴅ Eɴᴊᴏʏ 😍</b>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    HELP_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Hᴇʟᴘ Mᴏᴅᴜʟᴇ ⍟</b>

• Iᴛ's Nᴏᴛ Cᴏᴍᴘʟɪᴄᴀᴛᴇᴅ....🤓
• Dᴏɴ'ᴛ Sᴘᴀᴍ Mᴇ...🤒
• Hᴇʀᴇ Is Tʜᴇ Hᴇʟᴘ Cᴏᴍᴍᴀɴᴅs...😍

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    ABOUT_TXT = """<b>✯ Mʏ Nᴀᴍᴇ: <a href=https://t.me/Auto_Filter2_Bot>Rᴇᴅ Assᴀssɪɴ</a></b>
    
<b>✯ Cʀᴇᴀᴛᴏʀ: <a href=https://t.me/iFilms_Owner>༺Leͥgeͣnͫd༻</a></b>

<b>✯ Mʏ Gʀᴏᴜᴘ: <a href=https://t.me/iFilmsChatz>iFɪℓᴍs Cнατ</a></b>

<b>✯ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: ᴠ3.0.1 [Sᴛᴀʙʟᴇ]</b>"""
    SOURCE_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Sᴏᴜʀᴄᴇ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» Tʜɪs Is A Oᴘᴇɴ Sᴏᴜʀᴄᴇ Bᴏᴛ.</code>

<code>» Fᴏʀ Mᴏʀᴇ Jᴏɪɴ Uᴘᴅᴀᴛᴇs Cʜᴀɴɴᴇʟ.</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    MANUELFILTER_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Fɪʟᴛᴇʀs Mᴏᴅᴜʟᴇ ⍟</b>

<code>» Fɪʟᴛᴇʀ Is Tʜᴇ Fᴇᴀᴛᴜʀᴇ Wᴇʀᴇ Usᴇʀs Cᴀɴ Sᴇᴛ Aᴜᴛᴏᴍᴀᴛᴇᴅ Rᴇᴘʟɪᴇs Fᴏʀ A Pᴀʀᴛɪᴄᴜʟᴀʀ Kᴇʏᴡᴏʀᴅ.</code>

<b>✯ NOTE:</b>

• ʙᴏᴛ sʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘʀɪᴠɪʟʟᴀɢᴇ.
• ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴀᴅᴅ ғɪʟᴛᴇʀs.

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /filter - ᴀᴅᴅ ᴀ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ.
• /filters - ʟɪsᴛ ᴀʟʟ ᴛʜᴇ ғɪʟᴛᴇʀs ᴏғ ᴀ ᴄʜᴀᴛ.
• /del - ᴅᴇʟᴇᴛᴇ ᴀ sᴘᴇᴄɪғɪᴄ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ
• /delall - ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ғɪʟᴛᴇʀs ɪɴ ᴀ ᴄʜᴀᴛ (ᴄʜᴀᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    STRING_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Sᴛʀɪɴɢ Mᴏᴅᴜʟᴇ ⍟</b>
    
<code>» ᴛʜɪs ᴍᴏᴅᴜʟᴇ ᴏɴʟʏ ᴡᴏʀᴋs ғᴏʀ ᴍʏ ᴀᴅᴍɪɴs</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /pyrostring - ɢᴇɴᴇʀᴀᴛᴇ ᴘʏʀᴏ sᴛʀɪɴɢ.
• /telestring - ɢᴇɴᴇʀᴀᴛᴇ ᴛᴇʟᴇᴛʜᴏɴ sᴛʀɪɴɢ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    GUIDE_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Gᴜɪᴅᴇ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ʜᴏᴡ ᴄᴀɴ ʏᴏᴜ ᴜsᴇ ᴏᴜʀ ʙᴏᴛ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘs ?</code>

<b>✯ Usᴀɢᴇs:</b>

• ᴊᴜsᴛ ᴀᴅᴅ ᴏᴜʀ ʙᴏᴛ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ & ᴍᴀᴋᴇ ɪᴛ ᴀᴅᴍɪɴ.

• ʙᴏᴛ ᴡɪʟʟ ᴅᴏ ᴇᴠᴇʀʏᴛʜɪɴɢ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ, ɪᴛ ᴡɪʟʟ ɢɪᴠᴇ ᴍᴏᴠɪᴇs, ᴄʜᴇᴄᴋ sᴘᴇʟʟɪɴɢs & ᴍᴏʀᴇ.

• ᴄʜᴇᴄᴋ ᴏᴜᴛ ᴏᴛʜᴇʀ ᴍᴏᴅᴜʟᴇs ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    GAMES_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Gᴀᴍᴇs Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /throw - ᴛ𝗈 ᴍᴀᴋ𝖾 ᴅᴀʀᴛ
• /roll - ʀᴏʟʟ ᴛʜᴇ ᴅɪᴄᴇ 
• /bowling - ᴛᴏ ᴘʟᴀʏ ʙᴏᴡʟɪɴɢ ɢᴀᴍᴇ
• /football - ᴛᴏ ᴍᴀᴋᴇ ᴀ ɢᴏᴀʟ ᴏʀ sʜᴏᴏᴛ
• /basketball - ᴛᴏ ᴘʟᴀʏ ʙᴀsᴋᴇᴛʙᴀʟʟ 
• /luck - sᴘɪɴ ᴛʜᴇ ʟᴜᴄᴋʏ ᴡʜᴇᴇʟ

<b>✯ Wᴀɴᴛ Mᴏʀᴇ Gᴀᴍᴇs ?</b>

<code>» ɢᴏ ᴛᴏ ᴘʟᴀʏ sᴛᴏʀᴇ ᴏʀ ᴀᴘᴘ sᴛᴏʀᴇ ᴀɴᴅ ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ɢᴀᴍᴇ. ᴅᴏɴ'ᴛ ᴅɪsᴛᴜʀʙ ᴍᴇ 😜</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    PMUSIC_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Mᴜsɪᴄ Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

<code>» sᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ᴄʜᴇᴄᴋ ᴏᴜᴛ ɪᴛ's ʜᴇʟᴘ sᴇᴄᴛɪᴏɴ.</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    IFSUPD_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Uᴘᴅᴀᴛᴇs Mᴏᴅᴜʟᴇ ⍟</b>"""
    BUTTON_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Bᴜᴛᴛᴏɴ Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Usᴀɢᴇs:</b>

• ᴛᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛ ᴀʟʟᴏᴡs ʏᴏᴜ ᴛᴏ sᴇɴᴅ ʙᴜᴛᴛᴏɴs ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ, sᴏ ᴄᴏɴᴛᴇɴᴛ ɪs ᴍᴀɴᴅᴀᴛᴏʀʏ.

• ᴍɪss ʟᴇɪɢʜᴛᴏɴ sᴜᴘᴘᴏʀᴛs ʙᴜᴛᴛᴏɴs ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.

• ʙᴜᴛᴛᴏɴs sʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀsᴇᴅ ᴀs ᴍᴀʀᴋᴅᴏᴡɴ ғᴏʀᴍᴀᴛ.

<b>✯ Cᴏᴍᴍᴀɴᴅs:</b>

★ Uʀʟ Bᴜᴛᴛᴏɴs:

<code>[Button Text](buttonurl:https://t.me/FilmokamellaX)</code>

★ Aʟᴇʀᴛ Bᴜᴛᴛᴏɴs:

<code>[Button Text](buttonalert:ᴛʜɪs ɪs ᴀɴ ᴀʟᴇʀᴛ ᴍᴇssᴀɢᴇ)</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    AUTOFILTER_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Aᴜᴛᴏ Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• ᴍᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏғ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪғ ɪᴛ's ᴘʀɪᴠᴀᴛᴇ.
• ᴍᴀᴋᴇ sᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇs ɴᴏᴛ ᴄᴏɴᴛᴀɪɴs ᴄᴀᴍʀɪᴘs, ᴘᴏʀɴ ᴀɴᴅ ғᴀᴋᴇ ғɪʟᴇs.
• ғᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ᴛᴏ ᴍᴇ ᴡɪᴛʜ ϙᴜᴏᴛᴇs.
• ɪ'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ғɪʟᴇs ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    CONNECTION_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Cᴏɴɴᴇᴄᴛ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴜsᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ ᴘᴍ ғᴏʀ ғɪʟᴛᴇʀs.</code>
<code>» ɪᴛ ʜᴇʟᴘs ᴛᴏ ᴀᴠᴏɪᴅ sᴘᴀᴍᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘs.</code>

<b>✯ NOTE:</b>

★ ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
★ sᴇɴᴅ <code>/connect</code> ғᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ᴜʀ ᴘᴍ.

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>
• /connect  - ᴄᴏɴɴᴇᴄᴛ ᴀ ᴀɴʏ ᴄʜᴀᴛ.
• /disconnect  - ᴅɪsᴄᴏɴɴᴇᴄᴛ ғʀᴏᴍ ᴀ ᴄʜᴀᴛ.
• /connections - ʟɪsᴛ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛɪᴏɴs.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    ADMIN_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Aᴅᴍɪɴ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴛʜɪs ᴍᴏᴅᴜʟᴇ ᴏɴʟʏ ᴡᴏʀᴋs ғᴏʀ ᴍʏ ᴀᴅᴍɪɴs</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /logs - ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʀᴇsᴄᴇɴᴛ ᴇʀʀᴏʀs.
• /stats - ᴛᴏ ɢᴇᴛ sᴛᴀᴛᴜs ᴏғ ғɪʟᴇs ɪɴ ᴅʙ.
• /delete - ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ sᴘᴇᴄɪғɪᴄ ғɪʟᴇ.
• /users - ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴍʏ ᴜsᴇʀs.
• /chats - ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴛʜᴇ ᴍʏ ᴄʜᴀᴛs.
• /leave  - ᴛᴏ ʟᴇᴀᴠᴇ ғʀᴏᴍ ᴀ ᴄʜᴀᴛ.
• /disable  -  ᴅᴏ ᴅɪsᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.
• /ban_users  - ᴛᴏ ʙᴀɴ ᴀ ᴜsᴇʀ.
• /unban_users - ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴜsᴇʀ.
• /channel - ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴀʟʟ ᴄʜᴀɴɴᴇʟs.
• /broadcast - ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    STATUS_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Sᴛᴀᴛᴜs Mᴏᴅᴜʟᴇ ⍟</b>
    
★ 𝚃𝙾𝚃𝙰𝙻 𝙵𝙸𝙻𝙴𝚂: <code>1{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝚄𝚂𝙴𝚁𝚂: <code>9{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝙲𝙷𝙰𝚃𝚂: <code>7{}</code>
★ 𝚄𝚂𝙴𝙳 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝙱
★ 𝙵𝚁𝙴𝙴 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝙱

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    PASTE_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Pᴀsᴛᴇ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴘᴀsᴛᴇ sᴏᴍᴇ ᴛᴇxᴛs ᴏʀ ᴅᴏᴄᴜᴍᴇɴᴛs ᴏɴ ᴀ ᴡᴇʙsɪᴛᴇ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /paste [ᴛᴇxᴛ] - ᴘᴀsᴛᴇ ᴛʜᴇ ɢɪᴠᴇɴ ᴛᴇxᴛ ᴏɴ ᴘᴀsᴛʏ
• /paste [ʀᴇᴘʟʏ] - ᴘᴀsᴛᴇ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴇxᴛ ᴏɴ ᴘᴀsᴛʏ

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    TGRAPH_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Tᴇʟᴇɢʀᴀᴘʜ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴡɪᴛʜ ᴛʜɪs ʏᴏᴜ ᴄᴀɴ ᴇᴀsɪʟʏ ᴜᴘʟᴏᴀᴅ ʏᴏᴜʀ ᴍᴇᴅɪᴀ ᴏɴ ᴛᴇʟᴇɢʀᴀᴘʜ's ᴡᴇʙsɪᴛᴇ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /tgraph - ᴜᴘʟᴏᴀᴅ sᴜᴘᴘᴏʀᴛᴇᴅ ᴍᴇᴅɪᴀ (ᴡɪᴛʜɪɴ 5ᴍʙ) ᴛᴏ ᴛᴇʟᴇɢʀᴀᴘʜ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    INFO_TXT ="""<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Usᴇʀs Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /id - ɢᴇᴛ ɪᴅ ᴏғ ᴀ sᴘᴇᴄɪғᴇᴅ ᴜsᴇʀ.
• /info  - ɢᴇᴛ ɪɴғᴏ ᴀʙᴏᴜᴛ ᴀ ᴜsᴇʀ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    GTRANS_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Tʀᴀɴsʟᴀᴛᴇ Mᴏᴅᴜʟᴇ ⍟</b>
    
<code>» ᴛʀᴀɴsʟᴀᴛᴇ ᴛᴇxᴛs ᴛᴏ ᴀ sᴘᴇᴄɪғɪᴄ ʟᴀɴɢᴜᴀɢᴇ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /tr - [ʟᴀɴɢᴜᴀɢᴇ ᴄᴏᴅᴇ][ʀᴇᴘʟʏ] - ᴛʀᴀɴsʟᴀᴛᴇ ʀᴇᴘʟɪᴇᴅ ᴍᴇssᴀɢᴇ ᴛᴏ sᴘᴇᴄɪғɪᴄ ʟᴀɴɢᴜᴀɢᴇ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    EXTRAMOD_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Sᴇᴀʀᴄʜ Mᴏᴅᴜʟᴇ ⍟</b>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /imdb  - ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏ ғʀᴏᴍ ɪᴍᴅʙ.
• /search  - ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏ ғʀᴏᴍ sᴏᴜʀᴄᴇs.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    
    PURGE_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Sᴇᴀʀᴄʜ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ɴᴇᴇᴅ ᴛᴏ ᴅᴇʟᴇᴛᴇ ʟᴏᴛs ᴏғ ᴍᴇssᴀɢᴇs? ᴛʜᴀᴛ's ᴡʜᴀᴛ ᴘᴜʀɢᴇs ᴀʀᴇ ғᴏʀ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /purge  - ᴅᴇʟᴇᴛᴇ ᴀʟʟ ᴍᴇssᴀɢᴇs ғʀᴏᴍ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴏ ᴍᴇssᴀɢᴇ, ᴛᴏ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴍᴇssᴀɢᴇ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""  
    RESTRIC_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Rᴇsᴛʀɪᴄᴛɪᴏɴs Mᴏᴅᴜʟᴇ ⍟</b>

<code>» sᴏᴍᴇ ᴘᴇᴏᴘʟᴇ ɴᴇᴇᴅ ᴛᴏ ʙᴇ ᴘᴜʙʟɪᴄʟʏ ʙᴀɴɴᴇᴅ; ᴛʜɪs ᴍᴏᴅᴜʟᴇ ᴀʟʟᴏᴡs ʏᴏᴜ ᴛᴏ ᴅᴏ ᴛʜᴀᴛ ᴇᴀsɪʟʏ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /ban - ʙᴀɴ ᴀ ᴜsᴇʀ.
• /tban - ᴛᴇᴍᴘᴏʀᴀʀɪʟʏ ʙᴀɴ ᴀ ᴜsᴇʀ. ᴇxᴀᴍᴘʟᴇ ᴛɪᴍᴇ ᴠᴀʟᴜᴇs: 4ᴍ = 4 ᴍɪɴᴜᴛᴇs, 3ʜ = 3 ʜᴏᴜʀs, 6ᴅ = 6 ᴅᴀʏs, 5ᴡ = 5 ᴡᴇᴇᴋs.
• /mute - ᴍᴜᴛᴇ ᴀ ᴜsᴇʀ.
• /tmute - ᴛᴇᴍᴘᴏʀᴀʀɪʟʏ ᴍᴜᴛᴇ ᴀ ᴜsᴇʀ. ᴇxᴀᴍᴘʟᴇ ᴛɪᴍᴇ ᴠᴀʟᴜᴇs: 4ᴍ = 4 ᴍɪɴᴜᴛᴇs, 3ʜ = 3 ʜᴏᴜʀs, 6ᴅ = 6 ᴅᴀʏs, 5ᴡ = 5 ᴡᴇᴇᴋs.
• /unban ᴏʀ /unmute - ᴜɴᴍᴜᴛᴇ ᴀ ᴜsᴇʀ & ᴜɴʙᴀɴ ᴀ ᴜsᴇʀ.

ᴇxᴀᴍᴘʟᴇs:
- ᴍᴜᴛᴇ ᴀ ᴜsᴇʀ ғᴏʀ ᴛᴡᴏ ʜᴏᴜʀs.
- /tmute @ᴜsᴇʀɴᴀᴍᴇ 2ʜ

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""   
    PIN_MESSAGE_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Pɪɴ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴀʟʟ ᴛʜᴇ ᴘɪɴ ʀᴇʟᴀᴛᴇᴅ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ғᴏᴜɴᴅ ʜᴇʀᴇ!</code>

<b>✯ NOTE:</b>

★ ᴀᴅᴅ 'ʟᴏᴜᴅ' ᴏʀ 'ɴᴏᴛɪғʏ' ᴛᴏ sᴇɴᴅ ᴀ ɴᴏᴛɪғɪᴄᴀᴛɪᴏɴ ᴛᴏ ɢʀᴏᴜᴘ ᴍᴇᴍʙᴇʀs.
★ ɪғ <code>/unpin</code> ᴜsᴇᴅ ᴀs ᴀ ʀᴇᴘʟʏ, ᴜɴᴘɪɴs ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴏ ᴍᴇssᴀɢᴇ.

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /pin - ᴘɪɴ ᴛʜᴇ ᴍᴇssᴀɢᴇ ʏᴏᴜ ʀᴇᴘʟɪᴇᴅ ᴛᴏ.
• /unpin -  ᴜɴᴘɪɴ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    URL_SHORTNER_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Uʀʟs Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴜsɪɴɢ ᴛʜɪs ʏᴏᴜ ᴄᴀɴ sʜᴏʀᴛ ʏᴏᴜʀ ʟɪɴᴋs!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /short <code>(ʟɪɴᴋ)</code> - ɪ ᴡɪʟʟ sᴇɴᴅ ᴛʜᴇ sʜᴏʀᴛᴇᴅ ʟɪɴᴋs.

ᴇxᴀᴍᴘʟᴇ:
<code>/short https://t.me/FilmokamellaX</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    TTS_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ TTS Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴀ ᴍᴏᴅᴜʟᴇ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ ᴠᴏɪᴄᴇ ᴡɪᴛʜ ʟᴀɴɢᴜᴀɢᴇ sᴜᴘᴘᴏʀᴛ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /tts - ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ᴛᴇxᴛ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʟᴀɴɢᴜᴀɢᴇ ᴄᴏᴅᴇ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ᴀs ᴀᴜᴅɪᴏ.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    MUSIC_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Mᴜsɪᴄ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴍᴜsɪᴄ ᴅᴏᴡɴʟᴏᴀᴅᴇʀ ᴍᴏᴅᴜʟᴇ, ғᴏʀ ᴛʜᴏsᴇ ᴡʜᴏ ʟᴏᴠᴇ ᴍᴜsɪᴄ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>
• /song ᴏʀ /mp3 (sᴏɴɢɴᴀᴍᴇ) - ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢ ғʀᴏᴍ ʏᴛ sᴇʀᴠᴇʀs.
• /video ᴏʀ /mp4 (sᴏɴɢɴᴀᴍᴇ) - ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏ ғʀᴏᴍ ʏᴛ sᴇʀᴠᴇʀs.
• /ytthumb (ʏᴏᴜᴛᴜʙᴇ ʟɪɴᴋ) - ᴅᴏᴡɴʟᴏᴀᴅ ʏᴏᴜᴛᴜʙᴇ ᴛʜᴜᴍʙɴᴀɪʟs.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    PASSWORD_GEN_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Pɪɴ Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴛʜᴇʀᴇ ɪs ɴᴏᴛʜɪɴɢ ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ. sᴇɴᴅ ᴍᴇ ᴛʜᴇ ʟɪᴍɪᴛ ᴏғ ʏᴏᴜʀ ᴘᴀssᴡᴏʀᴅ.
- ɪ ᴡɪʟʟ ɢɪᴠᴇ ᴛʜᴇ ᴘᴀssᴡᴏʀᴅ ᴏғ ᴛʜᴀᴛ ʟɪᴍɪᴛ!</code>

<b>✯ NOTE:</b>

★ ᴏɴʟʏ ᴅɪɢɪᴛs ᴀʀᴇ ᴀʟʟᴏᴡᴇᴅ.
★ ᴍᴀxɪᴍᴜᴍ ᴀʟʟᴏᴡᴇᴅ ᴅɪɢɪᴛs ᴛɪʟʟ 84 
(ɪ ᴄᴀɴ'ᴛ ɢᴇɴᴇʀᴀᴛᴇ ᴘᴀssᴡᴏʀᴅs ᴀʙᴏᴠᴇ ᴛʜᴇ ʟᴇɴɢᴛʜ 84)

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>

• /genpassword ᴏʀ /genpw <code>2021</code>

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    ZOMBIES_TXT = """<b>⍟ Wᴇʟᴄᴏᴍᴇ Tᴏ Zᴏᴍʙɪᴇs Mᴏᴅᴜʟᴇ ⍟</b>

<code>» ᴋɪᴄᴋ ɪɴᴄᴀᴛɪᴠᴇ ᴍᴇᴍʙᴇʀs ғʀᴏᴍ ɢʀᴏᴜᴘ. ᴀᴅᴅ ᴍᴇ ᴀs ᴀᴅᴍɪɴ ᴡɪᴛʜ ʙᴀɴ ᴜsᴇʀs ᴘᴇʀᴍɪssɪᴏɴ ɪɴ ɢʀᴏᴜᴘ!</code>

<b>✯ Cᴏᴍᴍᴀɴᴅs & Usᴀɢᴇs:</b>
• /inkick - ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜ ʀᴇϙᴜɪʀᴇᴅ ᴀʀɢᴜᴍᴇɴᴛs ᴀɴᴅ ɪ ᴡɪʟʟ ᴋɪᴄᴋ ᴍᴇᴍʙᴇʀs ғʀᴏᴍ ɢʀᴏᴜᴘ.
• /instatus - ᴛᴏ ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs ᴏғ ᴄʜᴀᴛ ᴍᴇᴍʙᴇʀ ғʀᴏᴍ ɢʀᴏᴜᴘ.
• /inkick within_month long_time_ago - ᴛᴏ ᴋɪᴄᴋ ᴜsᴇʀs ᴡʜᴏ ᴀʀᴇ ᴏғғʟɪɴᴇ ғᴏʀ ᴍᴏʀᴇ ᴛʜᴀɴ 6-7 ᴅᴀʏs.
• /inkick long_time_ago - ᴛᴏ ᴋɪᴄᴋ ᴍᴇᴍʙᴇʀs ᴡʜᴏ ᴀʀᴇ ᴏғғʟɪɴᴇ ғᴏʀ ᴍᴏʀᴇ ᴛʜᴀɴ ᴀ ᴍᴏɴᴛʜ ᴀɴᴅ ᴅᴇʟᴇᴛᴇᴅ ᴀᴄᴄᴏᴜɴᴛs.
• /dckick - ᴛᴏ ᴋɪᴄᴋ ᴅᴇʟᴇᴛᴇᴅ ᴀᴄᴄᴏᴜɴᴛs.

<b>Mᴀɪɴᴛᴀɪɴᴇᴅ Bʏ: @Filmokamella_X ⚔️</b>"""
    CREATOR_REQUIRED = """❗ ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏ ʙᴇ ᴛʜᴇ ɢʀᴏᴜᴘ ᴄʀᴇᴀᴛᴏʀ ᴛᴏ ᴅᴏ ᴛʜᴀᴛ ❗"""
      
    INPUT_REQUIRED = "❗ **ᴀʀɢᴜᴍᴇɴᴛs ʀᴇϙᴜɪʀᴇᴅ** ❗"
      
    KICKED = """✔️ sᴜᴄᴄᴇssғᴜʟʟʏ ᴋɪᴄᴋᴇᴅ {} ᴍᴇᴍʙᴇʀs ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ᴛʜᴇ ᴀʀɢᴜᴍᴇɴᴛs ᴘʀᴏᴠɪᴅᴇᴅ...!"""
      
    START_KICK = """🚮 ʀᴇᴍᴏᴠɪɴɢ ɪɴᴀᴄᴛɪᴠᴇ ᴍᴇᴍʙᴇʀs ᴛʜɪs ᴍᴀʏ ᴛᴀᴋᴇ ᴀ ᴡʜɪʟᴇ...!"""
      
    ADMIN_REQUIRED = """❗ ɪ ᴀᴍ ɴᴏᴛ ᴀɴ ᴀᴅᴍɪɴ ʜᴇʀᴇ\n__ʟᴇᴀᴠɪɴɢ ᴛʜɪs ᴄʜᴀᴛ, ᴀᴅᴅ ᴍᴇ ᴀɢᴀɪɴ ᴀs ᴀᴅᴍɪɴ ᴡɪᴛʜ ʙᴀɴ ᴜsᴇʀ ᴘᴇʀᴍɪssɪᴏɴ...!"""
      
    DKICK = """✔️ ᴋɪᴄᴋᴇᴅ {} ᴅᴇʟᴇᴛᴇᴅ ᴀᴄᴄᴏᴜɴᴛs sᴜᴄᴄᴇssғᴜʟʟʏ...!"""
      
    FETCHING_INFO = """ᴄᴏʟʟᴇᴄᴛɪɴɢ ᴜsᴇʀs ɪɴғᴏʀᴍᴀᴛɪᴏɴ...!"""
      
    STATUS = """{}\n\n🚮 Cʜᴀᴛ Mᴇᴍʙᴇʀ Sᴛᴀᴛᴜs :**\n\n```✯ Rᴇᴄᴇɴᴛʟʏ``` - {}\n```✯ Wɪᴛʜɪɴ Wᴇᴇᴋ``` - {}\n```✯ Wɪᴛʜɪɴ Mᴏɴᴛʜ``` - {}\n```✯ Lᴏɴɢ Tɪᴍᴇ Aɢᴏ``` - {}\n✯ Dᴇʟᴇᴛᴇᴅ Aᴄᴄᴏᴜɴᴛ - {}\n✯ Bᴏᴛ - {}\n✯ Uɴᴄᴀᴄʜᴇᴅ - {}"""
    
    LOG_TEXT_G = """<b>⍟ Nᴇᴡ Gʀᴏᴜᴘ Lᴏɢs ⍟</b>
    
<b>Gʀᴏᴜᴘ :</b> {}(<code>{}</code>)

<b>Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs :</b> <code>{}</code>

<b>Aᴅᴅᴇᴅ Bʏ :<b> {}

<b>⍟ #NewGroup ⍟</b>
"""
    LOG_TEXT_P = """<b>⍟ Nᴇᴡ Usᴇʀ Lᴏɢs ⍟</b>

<b>ID :</b> <code>{}</code>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>⍟ #NewUser ⍟</b>
"""
    NOT_SUBSCRIBED_TXT = """<b>⍟ Nᴏɴ Sᴜʙsᴄʀɪʙᴇʀ Lᴏɢs ⍟</b>

<b>ID :</b> <code>{}</code>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>Mᴇssᴀɢᴇ :</b> <code>{}</code>

<b>⍟ #NotSubscribed ⍟</b>
"""
    NO_RESULTS_TXT = """<b>⍟ Nᴏ Rᴇsᴜʟᴛs Lᴏɢs ⍟</b>

<b>ID :</b> <code>{}</code>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>Mᴇssᴀɢᴇ :</b> <code>{}</code>

<b>⍟ #NoResults ⍟</b>"""

    FILE_TAKEN_TXT = """<b>⍟ Fɪʟᴇ Tᴀᴋᴇɴ Lᴏɢs ⍟</b>

<b>ID :</b> <code>{}</code>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>Mᴇssᴀɢᴇ :</b> <code>{}</code>

<b>⍟ #FileTaken ⍟</b>
"""
    BANP_LOG_TXT = """<b>⍟ Bᴀɴɴᴇᴅ Usᴇʀ Lᴏɢs ⍟</b>

<b>Aᴅᴍɪɴ :</b> </b> <b>{}</b>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>⍟ #BannedUser ⍟</b>
"""
    UNBANP_LOG_TXT = """<b>⍟ UɴBᴀɴɴᴇᴅ Usᴇʀ Lᴏɢs ⍟</b>

<b>Aᴅᴍɪɴ :</b> </b> <b>{}</b>

<b>Nᴀᴍᴇ :</b> <b>{}</b>

<b>⍟ #UnBannedUser ⍟</b>
"""
    BANG_LOG_TXT = """<b>⍟ Bᴀɴɴᴇᴅ Gʀᴏᴜᴘ Lᴏɢs ⍟</b>

<b>Cʜᴀᴛ ID :</b> <code>{}</code>

<b>Cʜᴀᴛ Nᴀᴍᴇ:</b> <b>{}</b>

<b>Aᴅᴍɪɴ :</b> </b> <b>{}</b>

<b>⍟ #BannedGroup ⍟</b>
"""
    UNBANG_LOG_TXT = """<b>⍟ UɴBᴀɴɴᴇᴅ Gʀᴏᴜᴘ Lᴏɢs ⍟</b>

<b>Cʜᴀᴛ ID :</b> <code>{}</code>

<b>Aᴅᴍɪɴ :</b> </b> <b>{}</b>

<b>⍟ #UnBannedGroup ⍟</b>
"""
